IDEA StatiCa Open Model
TypeSLSLimitStressCheck Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of SLS check in extreme result
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum TypeSLSLimitStressCheck
Public Enumeration TypeSLSLimitStressCheck
public enum class TypeSLSLimitStressCheck
Members
Member name | Value | Description
notSet | -1 |  not set value
Check_7_2_2_Concrete_fck | 6 |  check 7.2 (2) is used
Check_7_2_3_Concrete_fck | 7 |  check 7.2 (3) is used
Check_7_2_5_Tendons_fpk | 8 |  check 7.2 (5) stress in reinforcement bars is used
Check_7_2_5_ReinforcementBars_fyk | 9 |  check 7.2 (5) stress in tendons is used
Check_5_10_3_2_Tendons | 10 |  check 5.10.3 (2) stress in tendons is used
Check_5_10_2_1_1_Tendons | 11 |  check 5.10.2.1 (1) stress in tendons is used
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace